<?php
$A =['a', 'a', 'b', 'c', 'c', 'c', 'c', 'd', 'd', 'd', 'e']; //のとき
$B = ['a','a', 'b', 'c', '4', 'd', '3', 'e'];                //となる
//文字型
$c = ['1', '2', '3', '4', '5', '6', '7', '8', '9'];  /*添字は１から始まる*/

$M = count($A);

$i = 0;
$j = 0;
while ($i < $M) {
  $j++;
  $B[$j] = $A[$i];                          /*1文字分をBに転記*/
  $n = 1;                                   /*連続文字数 = 1*/
  $k = $i + 1;
  while ($$k < $M && $A[$k] === $A[$i]) {
    $n++;
    $k++;
  }
  if ($n >= 3) {
    $j++;
    $B[$j] = $c[$n];                       /*連続文字数(数値)を数字（文字）として格納*/
  } else {
    if ($n === 2) {
      $j++;
      $B[$j] =$A[$i + 1];
    }
  }
  $i = $k;
}
 ?>
